Revit 2024 API
DoubleClickOptions.GetDoubleClickOptions Method
 Returns the current user's DoubleClickOptions.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public static DoubleClickOptions GetDoubleClickOptions()
Visual Basic
Public Shared Function GetDoubleClickOptions As DoubleClickOptions
Visual C++
public:
static DoubleClickOptions^ GetDoubleClickOptions()
Return Value
 The DoubleClickOptions for the current user.
See Also
DoubleClickOptions Class
Autodesk.Revit.UI Namespace